# ==============================================================
# Задание 5.15
# Вывести все делители натурального числа n.
# Дополнительно определить, является ли число простым.
# ==============================================================

n = int(input("Введите натуральное число: "))
count_divisors = 0

print(f"Делители числа {n}:", end=" ")

for divisor in range(1, n + 1):
    if n % divisor == 0:
        print(divisor, end=" ")
        count_divisors += 1
print()

if count_divisors == 2:
    print("Число простое")
else:
    print("Число не является простым")
