# ==============================================================
# Задание 6.15
# Дано натуральное число. Проверить, является ли оно палиндромом.
# Например: 12321 — палиндром, 1234 — нет.
# ==============================================================

number = int(input("Введите натуральное число: "))
original = number
reversed_number = 0

while number > 0:
    digit = number % 10
    reversed_number = reversed_number * 10 + digit
    number //= 10

if original == reversed_number:
    print("Число является палиндромом")
else:
    print("Число не является палиндромом")
