# ==============================================================
# Задание 6.23
# Найти:
# а) сумму всех целых чисел от 100 до 500;
# б) сумму от a до 500 (a вводится с клавиатуры; a <= 500);
# в) сумму от –10 до b (b вводится с клавиатуры; b >= –10);
# г) сумму от a до b (a и b вводятся с клавиатуры; b >= a).
# ==============================================================

# а) Сумма от 100 до 500
total = 0                       # начальное значение накопителя
for i in range(100, 501):       # 501 — чтобы 500 вошло в диапазон
    total += i                  # total = total + i

print(f"а) Сумма от 100 до 500 = {total}")

# Проверка формулой арифметической прогрессии: S = n*(a1+an)/2
# n = 500-100+1 = 401; S = 401*(100+500)/2 = 120300
print(f"   Проверка (формула): {401 * (100 + 500) // 2}")

# б) Сумма от a до 500
a = int(input("\nВведите a (a <= 500): "))
total = 0
for i in range(a, 501):
    total += i
print(f"б) Сумма от {a} до 500 = {total}")

# в) Сумма от –10 до b
b = int(input("\nВведите b (b >= -10): "))
total = 0
for i in range(-10, b + 1):
    total += i
print(f"в) Сумма от -10 до {b} = {total}")

# г) Сумма от a до b
a = int(input("\nВведите a: "))
b = int(input("Введите b (b >= a): "))
total = 0
for i in range(a, b + 1):
    total += i
print(f"г) Сумма от {a} до {b} = {total}")


# ==============================================================
# Задание 6.24
# Найти:
# а) произведение всех целых чисел от 8 до 15;
# б) произведение от a до 20 (a вводится; 1 <= a <= 20);
# в) произведение от 1 до b (b вводится; 1 <= b <= 20);
# г) произведение от a до b (a, b вводятся; b >= a).
# ==============================================================

# а) Произведение от 8 до 15
product = 1                     # начальное значение накопителя — 1 (НЕ 0!)
for i in range(8, 16):
    product *= i                # product = product * i

print(f"\nа) Произведение от 8 до 15 = {product}")

# б) Произведение от a до 20
a = int(input("\nВведите a (1 <= a <= 20): "))
product = 1
for i in range(a, 21):
    product *= i
print(f"б) Произведение от {a} до 20 = {product}")

# в) Произведение от 1 до b (факториал b)
b = int(input("\nВведите b (1 <= b <= 20): "))
product = 1
for i in range(1, b + 1):
    product *= i
print(f"в) Произведение от 1 до {b} = {product}  (это {b}!)")

# г) Произведение от a до b
a = int(input("\nВведите a: "))
b = int(input("Введите b (b >= a): "))
product = 1
for i in range(a, b + 1):
    product *= i
print(f"г) Произведение от {a} до {b} = {product}")
