# ==============================================================
# Задания 6.35 – 6.43
# Накопление суммы и произведения через ввод чисел с клавиатуры
# ==============================================================


# ==============================================================
# Задание 6.35
# Даны числа a1, a2, ..., an. Определить их сумму.
# (n вводится с клавиатуры, затем вводятся n чисел)
# ==============================================================

n = int(input("6.35. Введите количество чисел n: "))
total = 0
for i in range(1, n + 1):
    x = float(input(f"  Введите число a{i}: "))
    total += x          # накапливаем сумму
print(f"Сумма {n} чисел = {total}\n")


# ==============================================================
# Задание 6.36
# Даны натуральное число n и вещественные числа a1, ..., an.
# Определить сумму всех вещественных чисел.
# (аналог 6.35, акцент на вещественный тип)
# ==============================================================

n = int(input("6.36. Введите количество чисел n: "))
total = 0.0             # инициализируем как вещественное
for i in range(1, n + 1):
    x = float(input(f"  Введите число a{i}: "))
    total += x
print(f"Сумма {n} вещественных чисел = {total:.4f}\n")


# ==============================================================
# Задание 6.37
# Известна масса каждого из 12 предметов.
# Определить общую массу всего набора.
# ==============================================================

print("6.37. Введите массу каждого из 12 предметов:")
total_mass = 0.0
for i in range(1, 13):
    mass = float(input(f"  Масса предмета {i}: "))
    total_mass += mass
print(f"Общая масса: {total_mass:.2f}\n")


# ==============================================================
# Задание 6.38
# Известны оценки абитуриента на 4 экзаменах.
# Определить сумму набранных баллов.
# ==============================================================

print("6.38. Введите оценки на 4 экзаменах:")
total_score = 0
for i in range(1, 5):
    score = int(input(f"  Оценка за экзамен {i}: "))
    total_score += score
print(f"Сумма баллов: {total_score}\n")


# ==============================================================
# Задание 6.39
# В ведомости указана зарплата каждого сотрудника.
# Определить общую сумму выплат.
# (количество сотрудников вводится первым)
# ==============================================================

n = int(input("6.39. Введите количество сотрудников: "))
total_salary = 0.0
for i in range(1, n + 1):
    salary = float(input(f"  Зарплата сотрудника {i}: "))
    total_salary += salary
print(f"Общая сумма выплат: {total_salary:.2f}\n")


# ==============================================================
# Задание 6.40
# Известна масса каждого предмета в автомобиле.
# Определить общую массу груза.
# (количество предметов вводится первым)
# ==============================================================

n = int(input("6.40. Введите количество предметов: "))
total_weight = 0.0
for i in range(1, n + 1):
    w = float(input(f"  Масса предмета {i} (кг): "))
    total_weight += w
print(f"Общая масса груза: {total_weight:.2f} кг\n")


# ==============================================================
# Задание 6.41
# Известно сопротивление каждого элемента цепи.
# Все элементы соединены параллельно.
# Определить общее сопротивление.
# Формула: 1/R = 1/R1 + 1/R2 + ... + 1/Rn → R = 1 / (сумма обратных)
# ==============================================================

n = int(input("6.41. Введите количество элементов цепи: "))
sum_inverse = 0.0           # сумма величин 1/Ri
for i in range(1, n + 1):
    r = float(input(f"  Сопротивление R{i} (Ом): "))
    sum_inverse += 1 / r    # 1/Ri прибавляем к сумме
total_resistance = 1 / sum_inverse
print(f"Общее сопротивление (параллельно): {total_resistance:.4f} Ом\n")


# ==============================================================
# Задание 6.42
# Даны числа a1, a2, ..., a6. Определить их произведение.
# ==============================================================

print("6.42. Введите 6 чисел:")
product = 1.0               # начальное значение накопителя-произведения = 1
for i in range(1, 7):
    x = float(input(f"  a{i} = "))
    product *= x            # умножаем накопитель на очередное число
print(f"Произведение 6 чисел = {product:.4f}\n")


# ==============================================================
# Задание 6.43
# Даны числа a1, a2, ..., a10. Определить сумму их квадратов.
# ==============================================================

print("6.43. Введите 10 чисел:")
sum_of_squares = 0.0
for i in range(1, 11):
    x = float(input(f"  a{i} = "))
    sum_of_squares += x ** 2    # прибавляем квадрат текущего числа
print(f"Сумма квадратов 10 чисел = {sum_of_squares:.4f}")
