# ==============================================================
# Задание 6.17
# Таблица стоимости 50, 100, 150, ..., 1000 г сыра.
# Цена за 1 кг вводится с клавиатуры.
# ==============================================================

price_per_kg = float(input("Введите стоимость 1 кг сыра (руб.): "))

print("\nМасса (г) | Стоимость (руб.)")
print("-" * 30)

# range(50, 1001, 50) — от 50 до 1000 с шагом 50
for grams in range(50, 1001, 50):
    # Цена за граммы = цена за кг * (граммы / 1000)
    cost = price_per_kg * grams / 1000
    print(f"  {grams:5d}   |  {cost:.2f}")


# ==============================================================
# Задание 6.18
# Таблица стоимости 100, 200, ..., 2000 г конфет.
# Цена за 1 кг вводится с клавиатуры.
# ==============================================================

price_per_kg = float(input("\nВведите стоимость 1 кг конфет (руб.): "))

print("\nМасса (г) | Стоимость (руб.)")
print("-" * 30)

for grams in range(100, 2001, 100):    # шаг 100 г
    cost = price_per_kg * grams / 1000
    print(f"  {grams:5d}   |  {cost:.2f}")


# ==============================================================
# Задание 6.19
# Вывести «столбиком»: 2.1, 2.2, 2.3, ..., 2.8
# ==============================================================

print("\nПоследовательность 2.1, 2.2, ..., 2.8:")
# Используем целый счётчик i = 1..8 → x = 2 + i/10
# (избегаем накопления погрешности при вещественном сложении)
for i in range(1, 9):
    x = 2 + i / 10
    print(f"{x:.1f}")
