# ==============================================================
# Задание 6.1
# Напечатать ряд чисел 20 в виде: 20 20 20 20 20 20 20 20 20 20
# ==============================================================

# end=" " — не переходить на новую строку, а ставить пробел
# После цикла — print() для перевода строки
for i in range(10):       # range(10) даёт 0,1,...,9 — всего 10 итераций
    print(20, end=" ")
print()                   # переход на новую строку


# ==============================================================
# Задание 6.2
# Вывести любое число любое заданное число раз (в одну строку).
# ==============================================================

number = int(input("Введите число: "))
times  = int(input("Сколько раз вывести: "))

for i in range(times):
    print(number, end=" ")
print()


# ==============================================================
# Задание 6.3
# Напечатать «столбиком»:
# а) все целые числа от 20 до 35;
# б) квадраты всех целых чисел от 10 до b;
# в) третьи степени всех целых чисел от a до 50;
# г) все целые числа от a до b.
# ==============================================================

print("\n--- 6.3а: числа от 20 до 35 ---")
# range(20, 36) — от 20 включительно до 35 включительно (36 не входит)
for i in range(20, 36):
    print(i)

print("\n--- 6.3б: квадраты от 10 до b ---")
b = int(input("Введите b (b >= 10): "))
for i in range(10, b + 1):
    print(i ** 2)          # ** — возведение в степень

print("\n--- 6.3в: кубы от a до 50 ---")
a = int(input("Введите a (a <= 50): "))
for i in range(a, 51):
    print(i ** 3)

print("\n--- 6.3г: числа от a до b ---")
a = int(input("Введите a: "))
b = int(input("Введите b (b >= a): "))
for i in range(a, b + 1):
    print(i)


# ==============================================================
# Задание 6.4
# Напечатать числа следующим образом:
# а) 10  10.4
#    11  11.4
#    ...
#    25  25.4
#
# б) 25  25.5  24.8
#    26  26.5  25.8
#    ...
#    35  35.5  34.8
# ==============================================================

print("\n--- 6.4а ---")
# Первый столбец: целые от 10 до 25
# Второй столбец: то же число + 0.4
for i in range(10, 26):
    print(i, i + 0.4)

print("\n--- 6.4б ---")
# Первый столбец: целые от 25 до 35
# Второй столбец: i + 0.5
# Третий столбец: i - 0.2
for i in range(25, 36):
    print(i, i + 0.5, i - 0.2)


# ==============================================================
# Задание 6.5
# Напечатать числа следующим образом:
# а) 21  19.2
#    20  18.2
#    ...
#    10   8.2
#
# б) 45  44.5  44.2
#    44  43.5  43.2
#    ...
#    25  24.5  24.2
# ==============================================================

print("\n--- 6.5а ---")
# Первый столбец убывает от 21 до 10 → range(21, 9, -1) — шаг -1
# Второй столбец: i - 1.8
for i in range(21, 9, -1):
    print(i, i - 1.8)

print("\n--- 6.5б ---")
# Первый столбец убывает от 45 до 25 → range(45, 24, -1)
# Второй: i - 0.5; Третий: i - 0.8
for i in range(45, 24, -1):
    print(i, i - 0.5, i - 0.8)


# ==============================================================
# Задание 6.6
# Напечатать числа следующим образом:
# а) 21  20.4
#    22  21.4
#    ...
#    35  34.4
#
# б) 16  15.5  16.8
#    17  16.5  17.8
#    ...
#    24  23.5  24.8
# ==============================================================

print("\n--- 6.6а ---")
for i in range(21, 36):
    print(i, i - 0.6)

print("\n--- 6.6б ---")
for i in range(16, 25):
    print(i, i - 0.5, i + 0.8)
