import math

# ==============================================================
# Задание 6.7
# Одна штука товара стоит 20.4 руб.
# Напечатать таблицу стоимости 2, 3, ..., 20 штук.
# ==============================================================

price_per_unit = 20.4

print("Кол-во | Стоимость (руб.)")
print("-" * 25)
for qty in range(2, 21):          # от 2 до 20 включительно
    total = qty * price_per_unit
    print(f"  {qty:2d}   |  {total:.2f}")  # :2d — целое шириной 2; :.2f — 2 знака после точки


# ==============================================================
# Задание 6.8
# Таблица: фунты → килограммы (1 фунт = 453 г = 0.453 кг)
# Для значений 1, 2, ..., 10 фунтов.
# ==============================================================

print("\nФунты | Килограммы")
print("-" * 20)
for pounds in range(1, 11):
    kg = pounds * 0.453
    print(f"  {pounds:2d}  |  {kg:.3f}")


# ==============================================================
# Задание 6.9
# Таблица: дюймы → сантиметры (1 дюйм = 25.4 мм = 2.54 см)
# Для значений 10, 11, ..., 22 дюйма.
# ==============================================================

print("\nДюймы | Сантиметры")
print("-" * 20)
for inches in range(10, 23):
    cm = inches * 2.54
    print(f"  {inches:2d}  |  {cm:.2f}")


# ==============================================================
# Задание 6.10
# Таблица умножения на 7: 1 × 7 = 7, ..., 9 × 7 = 63
# ==============================================================

print("\nТаблица умножения на 7:")
for i in range(1, 10):
    print(f"{i} x 7 = {i * 7}")


# ==============================================================
# Задание 6.11
# Таблица умножения на 9: 9 × 1 = 9, ..., 9 × 9 = 81
# ==============================================================

print("\nТаблица умножения на 9:")
for i in range(1, 10):
    print(f"9 x {i} = {9 * i}")


# ==============================================================
# Задание 6.12
# Таблица умножения на число n (вводится с клавиатуры; 1 <= n <= 9)
# ==============================================================

n = int(input("\nВведите число n (от 1 до 9): "))
print(f"Таблица умножения на {n}:")
for i in range(1, 10):
    print(f"{i} x {n} = {i * n}")


# ==============================================================
# Задание 6.13
# Напечатать «столбиком» значения sin 2°, sin 3°, ..., sin 20°
# math.radians() переводит градусы в радианы (нужно для math.sin)
# ==============================================================

print("\nsin от 2° до 20°:")
for deg in range(2, 21):
    rad = math.radians(deg)      # переводим градусы в радианы
    print(f"sin({deg:2d}°) = {math.sin(rad):.6f}")


# ==============================================================
# Задание 6.16
# Вывести «столбиком» значения sin 0.1, sin 0.2, ..., sin 1.1
# (аргументы — в радианах)
# ==============================================================

print("\nsin(x) для x = 0.1, 0.2, ..., 1.1 (радианы):")
# Используем целый счётчик i = 1..11, а x = i / 10.0 чтобы избежать
# погрешностей при сложении вещественных чисел в цикле
for i in range(1, 12):
    x = i / 10.0
    print(f"sin({x:.1f}) = {math.sin(x):.6f}")
