import math

# ==============================================================
# Задание 1.1
# Вывести на экран число с точностью до сотых.
# ==============================================================

number = 3.14159265

# Форматируем число с точностью до 2 знаков после запятой
print(f"Число с точностью до сотых: {number:.2f}")


# ==============================================================
# Задание 1.2
# Вывести на экран число e (основание натурального логарифма)
# с точностью до десятых.
# ==============================================================

# math.e — константа числа Эйлера (e ≈ 2.718...)
# Форматируем с точностью до 1 знака после запятой
print(f"Число e с точностью до десятых: {math.e:.1f}")


# ==============================================================
# Задание 1.3
# Вывести на одной строке числа 1, 13 и 49
# с одним пробелом между ними.
# ==============================================================

# sep=" " — разделитель между аргументами (по умолчанию уже пробел)
print(1, 13, 49, sep=" ")


# ==============================================================
# Задание 1.4
# Составить программу вывода на экран в одну строку трёх
# любых чисел с двумя пробелами между ними.
# ==============================================================

a = 7
b = 42
c = 100

# sep="  " — два пробела между значениями
print(a, b, c, sep="  ")


# ==============================================================
# Задание 1.5
# Вывести на экран числа 5, 10 и 21 одно под другим,
# используя один print.
# ==============================================================

# \n — символ переноса строки, позволяет разместить числа под другом
print(5, 10, 21, sep="\n")
