from random import randint


# ==============================================================
# Задание 7.13
# Создать список из 15 случайных чисел.
# Найти сумму элементов, которые стоят на чётных индексах.
# ==============================================================

numbers = []

for _ in range(15):
    numbers.append(randint(-50, 50))

total = 0

for i in range(len(numbers)):
    if i % 2 == 0:
        total += numbers[i]

print(f"Список: {numbers}")
print(f"Сумма элементов на чётных индексах = {total}")
