import math

# ==============================================================
# Задание 4.37
# Уменьшить первое число в два раза, если оно больше второго
# по абсолютной величине (по модулю).
# ==============================================================

a = 10
b = -3

print(f"Исходные: a = {a}, b = {b}")
print(f"Модули: |a| = {abs(a)}, |b| = {abs(b)}")

# abs() возвращает абсолютную величину (модуль) числа
if abs(a) > abs(b):
    a = a / 2  # уменьшаем в два раза
    print(f"|a| > |b|, поэтому a уменьшается вдвое → a = {a}")
else:
    print(f"|a| не больше |b|, a остаётся прежним → a = {a}")


# ==============================================================
# Задание 4.38
# Даны два числа. Если √b < a, то увеличить b в пять раз.
# ==============================================================

print()
a = 10
b = 64

print(f"Исходные: a = {a}, b = {b}")
print(f"√b = √{b} = {math.sqrt(b):.4f}")

if math.sqrt(b) < a:
    b = b * 5
    print(f"√b < a, поэтому b увеличивается в 5 раз → b = {b}")
else:
    print(f"√b >= a, b остаётся прежним → b = {b}")


# ==============================================================
# Задание 4.39
# Даны три целых числа. Вывести те из них, которые чётные.
# ==============================================================

print()
x = 4
y = 7
z = 12

print(f"Числа: {x}, {y}, {z}")
print("Чётные числа:", end=" ")

# Проверяем каждое число отдельно
if x % 2 == 0:
    print(x, end=" ")
if y % 2 == 0:
    print(y, end=" ")
if z % 2 == 0:
    print(z, end=" ")
print()  # перенос строки


# ==============================================================
# Задание 4.40
# Даны три вещественных числа. Возвести в квадрат те из них,
# значения которых неотрицательны (>= 0).
# ==============================================================

print()
a = -2.5
b = 3.0
c = 0.0

print(f"Исходные: a = {a}, b = {b}, c = {c}")

if a >= 0:
    a = a ** 2
if b >= 0:
    b = b ** 2
if c >= 0:
    c = c ** 2

print(f"После возведения в квадрат (неотриц.): a = {a}, b = {b}, c = {c}")


# ==============================================================
# Задание 4.41
# Даны три вещественных числа. Вывести те, которые принадлежат:
# а) интервалу (1.6 ; 3.8);
# б) интервалу (0.7 ; 5.1).
# ==============================================================

print()
a = 1.8
b = 4.0
c = 3.5

print(f"Числа: a = {a}, b = {b}, c = {c}")

# а) Интервал (1.6, 3.8) — строгое неравенство, концы не включаются
print("а) Принадлежат интервалу (1.6, 3.8):", end=" ")
if 1.6 < a < 3.8:
    print(a, end=" ")
if 1.6 < b < 3.8:
    print(b, end=" ")
if 1.6 < c < 3.8:
    print(c, end=" ")
print()

# б) Интервал (0.7, 5.1)
print("б) Принадлежат интервалу (0.7, 5.1):", end=" ")
if 0.7 < a < 5.1:
    print(a, end=" ")
if 0.7 < b < 5.1:
    print(b, end=" ")
if 0.7 < c < 5.1:
    print(c, end=" ")
print()


# ==============================================================
# Задание 4.42
# Даны четыре вещественных числа. Определить, сколько из них
# отрицательных. Цикл не использовать.
# ==============================================================

print()
a = -1.5
b =  2.3
c = -0.7
d =  4.0

count = 0  # счётчик отрицательных чисел

# Прибавляем True (=1) если число отрицательное, иначе False (=0)
if a < 0:
    count += 1
if b < 0:
    count += 1
if c < 0:
    count += 1
if d < 0:
    count += 1

print(f"Числа: {a}, {b}, {c}, {d}")
print(f"Количество отрицательных: {count}")


# ==============================================================
# Задание 4.43
# Даны четыре целых числа. Определить, сколько из них чётных.
# ==============================================================

print()
a = 2
b = 5
c = 8
d = 11

count = 0

if a % 2 == 0:
    count += 1
if b % 2 == 0:
    count += 1
if c % 2 == 0:
    count += 1
if d % 2 == 0:
    count += 1

print(f"Числа: {a}, {b}, {c}, {d}")
print(f"Количество чётных: {count}")


# ==============================================================
# Задание 4.44
# Даны четыре вещественных числа. Найти сумму тех, которые > 5.
# Цикл не использовать.
# ==============================================================

print()
a = 3.0
b = 7.5
c = 1.2
d = 9.8

total = 0.0

if a > 5:
    total += a
if b > 5:
    total += b
if c > 5:
    total += c
if d > 5:
    total += d

print(f"Числа: {a}, {b}, {c}, {d}")
print(f"Сумма чисел > 5: {total}")


# ==============================================================
# Задание 4.45
# Даны четыре целых числа. Найти сумму тех, которые кратны трём.
# Цикл не использовать.
# ==============================================================

print()
a = 3
b = 7
c = 9
d = 11

total = 0

if a % 3 == 0:
    total += a
if b % 3 == 0:
    total += b
if c % 3 == 0:
    total += c
if d % 3 == 0:
    total += d

print(f"Числа: {a}, {b}, {c}, {d}")
print(f"Сумма кратных 3: {total}")
